app/views/lists/_form.html.erb

      <% if @list.new_record? or @list.type_of_list == "text" %>
        <% if current_user.twilio_phone_number.present? %>
---
SELECT `twilio_phone_numbers`.* FROM `twilio_phone_numbers` WHERE `twilio_phone_numbers`.`user_id` = 1 LIMIT 1