app/views/lists/check_validation.js.erb

  $("#error_list_shortcode_keyword").html("<%= @error[:shortcode_keyword] %>");
<% elsif @list.shortcode_keyword.present? or params[:list][:shortcode_keyword].present? %>
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`shortcode_keyword` = 'Micle' LIMIT 1