app/views/dashboard/profile.html.erb

SELECT `plans`.* FROM `plans` WHERE `plans`.`id` = 1 LIMIT 1
SELECT `subscriptions`.* FROM `subscriptions` WHERE `subscriptions`.`user_id` = 1 LIMIT 1
SELECT `twilio_phone_numbers`.* FROM `twilio_phone_numbers` WHERE `twilio_phone_numbers`.`user_id` = 1 LIMIT 1
---

<% if current_user.subscription.plan.recurring and @user.twilio_phone_number.blank? %>