app/views/shared/_dashboard_header.html.erb

SELECT SUM(number_of_recipients) as total_call FROM `calls` WHERE `calls`.`user_id` = 1 LIMIT 1
---
    <div class="right-stat">
      <%  @calls = current_user.calls.find(:first, :select => "SUM(number_of_recipients) as total_call") %>

SELECT SUM(number_of_texts_required) as total_text FROM `text_messages` WHERE `text_messages`.`user_id` = 1 LIMIT 1
SELECT COUNT(*) FROM `sms_messages` WHERE `sms_messages`.`user_id` = 1 AND `sms_messages`.`status` = 'received'
---
      </span>
      <% @texts = current_user.text_messages.find(:first, :select => "SUM(number_of_texts_required) as total_text")  %>
      <% @sms_count = current_user.sms_messages.where(:status => "received").count %>