app/views/shared/_dashboard_top_panel.html.erb

            <span class="label lasCount">Inbox</span>
            <% @unread_messages_count = current_user.sms_messages.count(:all, :conditions => ["sms_messages.read = ? and status = ?", false, "received"])  %>
---
SELECT COUNT(*) FROM `sms_messages` WHERE `sms_messages`.`user_id` = 1 AND (sms_messages.read = 0 and status = 'received')