app/views/shared/_meta_contents.html.erb

SELECT `meta_contents`.* FROM `meta_contents` ORDER BY created_at
---
<% @meta_contents = MetaContent.order("created_at") %>