app/views/shared/_select_list.html.erb

<% if current_user.lists.present? %>
---
SELECT `lists`.* FROM `lists` WHERE (lists.id <> NULL and lists.user_id = 1 and lists.name = 'Micle Jackson' and lists.type_of_list = 'text') LIMIT 1