app/views/text_messages/_send_text_step_2.html.erb

  <%#= f.select :list_id, current_user.lists.collect{|l| ["#{l.name} (#{l.number_of_contacts})",l.id]}, {}, :class => "simple_form" %>
        <% current_user.lists.each do |list| %>
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`user_id` = 1