app/views/text_messages/_send_text_step_1.html.erb

      <div class="g_10">
        <% if current_user.twilio_phone_number.present? %>
---
SELECT `twilio_phone_numbers`.* FROM `twilio_phone_numbers` WHERE `twilio_phone_numbers`.`user_id` = 1 LIMIT 1