app/controllers/billing_controller.rb

  def index
    @current_balance = current_user.current_balance
    @subscribed_plan = current_user.subscription.plan
    @monthly_charge = @subscribed_plan.amount.to_f / 100.0
    @price_per_call_or_text = @subscribed_plan.price_per_call_or_text.to_f / 100.0
    @total_call_can = (@current_balance.to_f / @price_per_call_or_text.to_f ).to_i
    @billing_setting = current_user.billing_setting
    @funds = current_user.receipts.where({:free => nil, :debit => "0"})

    Time.zone = current_user.time_zone
    if params[:date_from].present? && params[:date_to].present?
      @date_from = Time.zone.parse(params[:date_from].to_date.to_s).beginning_of_day.utc
      @date_to = Time.zone.parse(params[:date_to].to_date.to_s).end_of_day.utc
    else
      @date_from = Time.zone.now.beginning_of_month.utc
      @date_to = Time.zone.now.end_of_day.utc
    end
    Time.zone = "UTC"

    @transactions = current_user.receipts.by_date_range(@date_from, @date_to).order("id desc")
    if @transactions.present?
      @beginning_balance = @transactions.last.current_balance - @transactions.last.credit + @transactions.last.debit
      @total_debits = @transactions.sum(:debit)
---
SELECT SUM(`receipts`.`debit`) AS sum_id FROM `receipts` WHERE `receipts`.`user_id` = 1 AND (receipts.created_at BETWEEN '2014-12-01 05:00:00' AND '2014-12-26 04:59:59')
SELECT `billing_settings`.* FROM `billing_settings` WHERE `billing_settings`.`user_id` = 1 LIMIT 1
SELECT `receipts`.* FROM `receipts` WHERE `receipts`.`user_id` = 1 AND (receipts.created_at BETWEEN '2014-12-01 05:00:00' AND '2014-12-26 04:59:59') ORDER BY id desc LIMIT 1
SELECT `subscriptions`.* FROM `subscriptions` WHERE `subscriptions`.`user_id` = 1 LIMIT 1
SELECT SUM(`receipts`.`credit`) AS sum_id FROM `receipts` WHERE `receipts`.`user_id` = 1 AND (receipts.created_at BETWEEN '2014-12-01 05:00:00' AND '2014-12-26 04:59:59')
SELECT COUNT(*) FROM `receipts` WHERE `receipts`.`user_id` = 1 AND (receipts.created_at BETWEEN '2014-12-01 05:00:00' AND '2014-12-26 04:59:59')