app/controllers/calls_controller.rb

SELECT `recordings`.* FROM `recordings` WHERE `recordings`.`userID` = 1 AND (file IS NOT NULL and uploaded = 1) ORDER BY created_at DESC
SELECT SUM(number_of_recipients) as total_call FROM `calls` WHERE `calls`.`user_id` = 1 LIMIT 1
---
  def new
    @step = params["step"].present? ? params["step"] : "1"

    @recordings = current_user.recordings.where("file IS NOT NULL and uploaded = 1").order("created_at DESC")

    if @step == "2" and session[:call].blank? and params[:call].blank?
      flash.now.alert = "Please Select at least one recording!"
      @step = "1"
    end

    if session[:call].present?
      session[:call] = session[:call].merge(params[:call]) if params[:call].present?

      if params[:list_ids].present? and params[:list_ids].size > 0
        session[:call] = session[:call].merge({:list_ids => params[:list_ids].join(",")})
      elsif @step == "3" and session[:call][:list_ids].blank?
        flash.now.alert = "Please Select at least one contact list!"
        @step = "2"
      end
      @call = current_user.calls.new(session[:call])

    elsif params[:call].present?
      @call = current_user.calls.new(params[:call])
      session[:call] = params[:call]
    else
      @call = Call.new
    end

    if @step == "4" and session[:call].present? and @call.present?