app/controllers/contacts_controller.rb

SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`user_id` = 1
SELECT `lists`.* FROM `lists` WHERE `lists`.`user_id` = 270 ORDER BY created_at desc
SELECT COUNT(*) FROM `lists` WHERE `lists`.`user_id` = 1 AND (shortcode_keyword is not NULL)
SELECT `twilio_phone_numbers`.* FROM `twilio_phone_numbers` WHERE `twilio_phone_numbers`.`user_id` = 1 LIMIT 1
---
  def index
    @contacts = current_user.contacts.all
    @lists = current_user.lists.order("created_at desc")

    if params[:search].present?
      key = params[:search]
      @search_contacts = current_user.contacts.by_phone_number(key)
      key = params[:search].split(/\W/).join("")
      @search_contacts = current_user.contacts.by_phone_number(key) if @search_contacts.empty?

INSERT INTO `contacts` (`address_1`, `address_2`, `city`, `company_name`, `created_at`, `custom_1`, `custom_2`, `custom_3`, `custom_4`, `custom_5`, `do_not_import`, `email`, `first_name`, `last_name`, `list_id`, `phone_number`, `source`, `state`, `unique_identifier`, `updated_at`, `user_id`, `zip`) VALUES ('', '', '', '', '2015-01-29 14:58:15', '', '', '', '', '', NULL, '', '', '', 1, '(111) 111-1111', 'Manual Input', '', '', '2015-01-29 14:58:15', 1, '')
---
  def create
    @contact = current_user.contacts.new(params[:contact])
    @contact.source = "Manual Input"
    respond_to do |format|
      if @contact.save