app/controllers/dashboard_controller.rb

SELECT SUM(number_of_contacts) as total FROM `lists` WHERE `lists`.`user_id` = 1 AND (type_of_list = 'call') LIMIT 1
SELECT SUM(number_of_recipients) as total_call FROM `calls` WHERE `calls`.`user_id` = 1 LIMIT 1
SELECT `calls`.* FROM `calls` WHERE `calls`.`user_id` = 1
---
  def index
    @total_contacts_count = current_user.lists.sum_number_of_contacts.first.total.to_i
    @call_contacts_count = current_user.lists.sum_number_of_contacts.by_call.first.total.to_i

SELECT `lists`.* FROM `lists` WHERE (lists.id <> NULL and lists.user_id = 270 and lists.name = 'Micle Jackson' and lists.type_of_list = 'text') LIMIT 1
INSERT INTO `lists` (`created_at`, `greeting`, `keyword`, `name`, `number_of_contacts`, `shortcode_keyword`, `type_of_list`, `updated_at`, `user_id`) VALUES ('2015-03-06 03:07:06', NULL, NULL, 'Micle Jackson', 0, 'Micle', 'text', '2015-03-06 03:07:06', 270)
SELECT `plans`.* FROM `plans` WHERE `plans`.`id` = 5 LIMIT 1
SELECT `subscriptions`.* FROM `subscriptions` WHERE `subscriptions`.`user_id` = 270 LIMIT 1
SELECT `twilio_phone_numbers`.* FROM `twilio_phone_numbers` WHERE `twilio_phone_numbers`.`user_id` = 270 LIMIT 1
UPDATE `users` SET `last_activity_at` = '2015-03-06 03:07:06' WHERE `users`.`id` = 270
---
  def welcome_pop_up_submit
    if params[:list].present?
      @list = current_user.lists.new(params[:list])
      @list.type_of_list = "text"
      @list_create = true if @list.save
    end

    if current_user.subscription.plan.recurring and params[:twilio_phone_number].present?
      @tpn = current_user.build_twilio_phone_number(params[:twilio_phone_number])
      @number_create = true if @tpn.save