app/controllers/imports_controller.rb

  def create
    @import = current_user.imports.new(params[:import])

    if @import.save
---
INSERT INTO `imports` (`created_at`, `file_name`, `hold`, `list_id`, `mapping`, `number_of_contacts`, `updated_at`, `uploaded`, `user_id`) VALUES ('2015-01-29 14:57:23', NULL, NULL, 1, NULL, NULL, '2015-01-29 14:57:23', NULL, 1)

  def map_column
    @import = Import.find(params[:id])
---
SELECT `imports`.* FROM `imports` WHERE `imports`.`id` = 1 LIMIT 1