app/controllers/lists_controller.rb

INSERT INTO `lists` (`created_at`, `greeting`, `keyword`, `name`, `number_of_contacts`, `shortcode_keyword`, `type_of_list`, `updated_at`, `user_id`) VALUES ('2015-01-29 14:57:14', '', NULL, 'Micle Jackson', 0, NULL, 'text', '2015-01-29 14:57:14', 1)
---
  def create
    @list = current_user.lists.new(params[:list])

    respond_to do |format|
      if @list.save

SELECT `lists`.* FROM `lists` WHERE `lists`.`user_id` = 270 AND `lists`.`name` = 'Micle' AND `lists`.`type_of_list` IS NULL LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `lists`.* FROM `lists` WHERE `lists`.`shortcode_keyword` = 'Micle' LIMIT 1
---
  def check_validation
    @error = {}
    if params[:list_id].present?
      @list = List.find(params[:list_id])
      list = List.find(:first, :conditions => ["lists.id <> ? and lists.user_id = ? and lists.name = ? and lists.type_of_list = ?", @list.id, current_user.id, params[:list][:name], @list.type_of_list])
      @error[:name] = "You have already used this list name for list type #{@list.type_of_list} !" if list.present?
      list1 = List.find(:first, :conditions => ["lists.id <> ? and lists.user_id = ? and lists.keyword = ?", @list.id, current_user.id, params[:list][:keyword]]) if params[:list][:keyword].present?
      @error[:keyword] = "You have already used this keyword!" if list1.present?
      list2 = List.find(:first, :conditions => ["lists.id <> ? and lists.shortcode_keyword = ?", @list.id, params[:list][:shortcode_keyword]]) if params[:list][:shortcode_keyword].present?