app/controllers/sms_messages_controller.rb

SELECT `sms_messages`.* FROM `sms_messages` WHERE `sms_messages`.`user_id` = 1 AND `sms_messages`.`status` = 'received'
---
  def inbox
    @sms_messages = current_user.sms_messages.where(:status => "received")

SELECT `sms_messages`.* FROM `sms_messages` WHERE `sms_messages`.`user_id` = 1 AND (sms_messages.read = 0 and status = 'received')
---
  def inbox_read
    @sms_messages = current_user.sms_messages.find(:all, :conditions => ["sms_messages.read = ? and status = ?", false, "received"])