app/controllers/text_messages_controller.rb

      begin
        numbers = []
        @text_message.lists.each do |list|
          numbers = (numbers + Contact.where(:list_id => list.id).uniq.pluck(:phone_number)).uniq
---
SELECT DISTINCT phone_number FROM `contacts` WHERE `contacts`.`list_id` = 1

    end

    @current_balance = current_user.account_balance.current_balance
    @short_code = ShortCode.first
---
SELECT `short_codes`.* FROM `short_codes` LIMIT 1