app/controllers/text_messages_controller.rb

SELECT SUM(number_of_texts_required) as total_text FROM `text_messages` WHERE `text_messages`.`user_id` = 1 LIMIT 1
SELECT `lists`.* FROM `lists` WHERE `lists`.`user_id` = 1
---
  def new
    if params["step"].present?
      @step = params["step"]
    else
      @step = "1"
    end

    if session[:text_message].present?
      session[:text_message] = session[:text_message].merge(params[:text_message]) if params[:text_message].present?
      if params[:list_ids].present? and params[:list_ids].size > 0
        session[:text_message] = session[:text_message].merge({:list_ids => params[:list_ids].join(",")})
      elsif @step == "3" and session[:text_message][:list_ids].blank?
        flash.now.alert = "Please Select at least one contact list!"
        @step = "2"
      elsif @step == "3" and session[:text_message][:list_ids].present? and params[:list_ids].blank?
        session[:text_message][:list_ids] = nil
        flash.now.alert = "Please Select at least one contact list!"
        @step = "2"
      end
      @text_message = current_user.text_messages.new(session[:text_message])
    elsif params[:text_message].present?
      @text_message = current_user.text_messages.new(params[:text_message])
      session[:text_message] = params[:text_message]
    else
      @text_message = TextMessage.new
    end

    if params["step"] == "3" and params[:text_message].present?
      begin
        number_of_contacts = 0
        @text_message.lists.each do |list|

SELECT `meta_contents`.* FROM `meta_contents` ORDER BY created_at
---
        end

        cost_per_text = current_user.subscription.plan.price_per_call_or_text / 100.0
        message_size = (@text_message.content.length.to_f / 140.0).ceil