app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `last_activity_at` = '2014-12-25 16:25:01' WHERE `users`.`id` = 1
---
  def create
    @step_id = params[:step_id]

    if session[:user_temp_id].present?
      @user = User.find(session[:user_temp_id])
    else
      @user = User.new
    end

    if @step_id == "1"
      # create or update user
      if @user.update_attributes(params[:user])