app/controllers/users_controller.rb

INSERT INTO `users` (`activation_state`, `activation_token`, `activation_token_expires_at`, `address`, `created_at`, `crypted_password`, `email`, `failed_logins_count`, `last_activity_at`, `last_login_at`, `last_logout_at`, `lock_expires_at`, `name`, `organization_name`, `organization_type`, `phone`, `pin_number`, `pop_up_count`, `remember_me_token`, `remember_me_token_expires_at`, `reset_password_email_sent_at`, `reset_password_token`, `reset_password_token_expires_at`, `salt`, `state`, `text_messages_approval`, `time_zone`, `updated_at`) VALUES ('pending', 'M2qNZE8JM7Mw8prBR3Ea', NULL, NULL, '2014-12-25 16:24:50', '$2a$10$bWxsA/Cuby4Bu.LR6M3b/uLJGps.43PulLk5RCOo.8R1N7OCEqwqq', 'lionelgies0119@gmail.com', 0, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '756159', 0, NULL, NULL, NULL, NULL, NULL, 'bALETRzjCBL5DD9priGP', NULL, NULL, 'Eastern Time (US & Canada)', '2014-12-25 16:24:50')
INSERT INTO `billing_settings` (`card_expiry_date`, `card_holder_name`, `card_last_four_digits`, `card_type`, `created_at`, `stripe_id`, `updated_at`, `user_id`) VALUES (NULL, NULL, NULL, NULL, '2014-12-25 16:24:54', 'cus_5ORIc9ryg8bS8v', '2014-12-25 16:24:54', 1)
INSERT INTO `subscriptions` (`created_at`, `plan_id`, `status`, `trial_end`, `trial_start`, `updated_at`, `user_id`) VALUES ('2014-12-25 16:24:54', 1, 'trailing', '2015-01-01 16:24:54', '2014-12-25 16:24:54', '2014-12-25 16:24:54', 1)
---
  def create
    @user = User.new(params[:user])

    if @user.save
      find_plan(params[:pricing_plan])
      BillingSetting.create(:user_id => @user.id)
      Subscription.create(:user_id => @user.id, :plan_id => @plan.id)

SELECT `plans`.* FROM `plans` WHERE `plans`.`stripe_id` = 'high-usage' LIMIT 1
SELECT `plans`.* FROM `plans` WHERE (plans.default = 1) LIMIT 1
---
  def find_plan(stripe_id)
    @plan = Plan.find_by_stripe_id stripe_id
    @plan = Plan.default_plan.first unless @plan